import time

def start_animation():
    frames = [
        r"""
        WAR THUNDER
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        """,
        r"""
        \______________________
          _____________________
          \       
        ___\__________________
                              \
                               \
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        """,
        r"""
        _______________/
        _______________        >========>===>
                       \
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        """,
        r"""
        ___   /
        ___                          >========>===>
              \
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        """,
        r"""
        
                                   >========>===>
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        """,
        r"""
        
                                           >========>===>
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        """,
        r"""
        
                                    >========>===>
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        """,
        r"""
                                            /
                               >========>==/
                                          /
                                          
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        """,
        r"""
                                                    /
                                           >=======/
                                                  /
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
        """,
        r"""
                                                    /
                                              >====/
                                                  /
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
        """,
        r"""
                                                    /
                                                 >=/
                                                  /
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
        """,
        r"""
                                                    /
                                            >    --/
                                                  /
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
        """,
        r"""
        
        
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
        """,
    ]

    for frame in frames:
        print(frame)
        time.sleep(0.7)

start_animation()
score=0
print("Каким бронепробитием обладает ОБПС ЗБМ60? A - 150мм   Б - 300мм   В - 450мм   Г - 600мм")
an=input()
if an=="Г":
    print("You're damn right")
    score=score+1
elif an=="А":
    print("Я вижу, ты совсем ничего не знаешь о танках")
else:
    print("Нет, правильный вариант ответа Г - 600мм")
time.sleep(5)
print(








































)

print("В каком году был создан прототип первого советского ОБТ, называвшегося позже именем Т-64? A - 1959   Б - 1961   В - 1964   Г - 1968")
an=input()
if an=="А":
    print("Правильно! Наугад выбирал?")
    score=score+1
else:
    print("Нет, правильный ответ - А, 1959 год")
time.sleep(5)
print(


















































)

print(
    "Вячеслав Буланников, Картодел, Балансировщик, британский микро-колесник - хорошие существа? А - Да, Б - Нет конечно")
an = input()
if an == "А":
    print("Правильно! Улитка довольна вами, комьюнити вас ненавидит всей глубиной своей души")
    score=score+1
elif an == "Б":
    print("ЛИШЕНИЕ ТЕБЯ УРОНА, ДЕНЕГ, ДУШИ, ПОЧКИ ДО ТЕХ ПОР ПОКА НЕ ИЗВИНИШЬСЯ")
    time.sleep(10)
    print("Окей, время вышло")

time.sleep(5)
print(
















































)
print("Количество очков благословения улитки:",score)


def start_animation():
    frames = [
        r"""
        WAR THUNDER




















        """,
        r"""
        \______________________
          _____________________
          \       
        ___\__________________
                              \
                               \

















        """,
        r"""
        _______________/
        _______________        >========>===>
                       \


















        """,
        r"""
        ___   /
        ___                          >========>===>
              \

















        """,
        r"""

                                   >========>===>

















        """,
        r"""

                                           >========>===>

















        """,
        r"""

                                    >========>===>

















        """,
        r"""
                                            /
                               >========>==/
                                          /

















        """,
        r"""
                                                    /
                                           >=======/
                                                  /

















        """,
        r"""
                                                    /
                                              >====/
                                                  /

















        """,
        r"""
                                                    /
                                                 >=/
                                                  /

















        """,
        r"""
                                                    /
                                            >    --/
                                                  /

















        """,
        r"""



















        """,
    ]

    for frame in frames:
        print(frame)
        time.sleep(0.7)




exit()